## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.example_aws.module.batch.aws_batch_job_definition.this["example"] must be replaced
-/+ resource "aws_batch_job_definition" "this" {
!       arn                   = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs-example:1" -> (known after apply)
!       container_properties  = jsonencode(
            {
-               command                      = [
-                   "bash",
-                   "-c",
-                   "set",
                ]
-               environment                  = []
-               executionRoleArn             = "arn:aws:iam::376942697097:role/example-scheduled-jobs-ecs-task-exec"
-               fargatePlatformConfiguration = {
-                   platformVersion = "LATEST"
                }
-               image                        = "public.ecr.aws/debian/debian:bullseye"
-               logConfiguration             = {
-                   logDriver     = "awslogs"
-                   options       = {
-                       awslogs-group         = "/aws/batch/example-scheduled-jobs"
-                       awslogs-region        = "us-east-1"
-                       awslogs-stream-prefix = "example-scheduled-jobs"
                    }
-                   secretOptions = []
                }
-               mountPoints                  = []
-               resourceRequirements         = [
-                   {
-                       type  = "VCPU"
-                       value = "1"
                    },
-                   {
-                       type  = "MEMORY"
-                       value = "2048"
                    },
                ]
-               secrets                      = []
-               ulimits                      = []
-               volumes                      = []
            }
        ) -> (known after apply) # forces replacement
!       id                    = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs-example:1" -> (known after apply)
        name                  = "example-scheduled-jobs-example"
-       parameters            = {} -> null
!       revision              = 1 -> (known after apply)
        tags                  = {
            "job_definitions" = "example"
            "module"          = "batch"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.example_aws.module.eventbridge.aws_cloudwatch_event_target.this["example-scheduled-jobs-fargate_spot"] will be updated in-place
!   resource "aws_cloudwatch_event_target" "this" {
        id             = "example-scheduled-jobs-batch-rule-terraform-20220825150247370900000001"
        # (5 unchanged attributes hidden)

!       batch_target {
!           job_definition = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs-example:1" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.example_aws.module.execution_role.aws_iam_role.this[0] is tainted, so must be replaced
-/+ resource "aws_iam_role" "this" {
!       arn                   = "arn:aws:iam::376942697097:role/example-scheduled-jobs-ecs-task-exec" -> (known after apply)
!       assume_role_policy    = jsonencode(
!           {
!               Statement = [
!                   {
-                       Condition = {
-                           Bool            = {
-                               "aws:MultiFactorAuthPresent" = "true"
                            }
-                           NumericLessThan = {
-                               "aws:MultiFactorAuthAge" = "86400"
                            }
                        } -> null
                        # (4 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
!       create_date           = "2022-08-25T12:38:01Z" -> (known after apply)
!       id                    = "example-scheduled-jobs-ecs-task-exec" -> (known after apply)
!       managed_policy_arns   = [
-           "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
        name                  = "example-scheduled-jobs-ecs-task-exec"
+       name_prefix           = (known after apply)
        tags                  = {
            "module" = "execution_role"
        }
!       unique_id             = "AROAVPQ4JDKE64XMGWEKH" -> (known after apply)
        # (4 unchanged attributes hidden)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

